# Экранға сәлемдеме шығару
print("Сәлем, Python әлемі!") # Мәтін міндетті түрде тырнақшада болуы керек

# Мәліметтерді айнымалыларға сақтаймыз
aty = "Айжан"         # str (мәтін)
oqyityn_synyby = 9    # int (бүтін сан)

# Сақталған мәліметті қолдану
print(aty, oqyityn_synyby, "- сыныпта оқиды.")

# Пайдаланушыдан ақпарат сұрау
paydalanyshy_esimi = input("Есіміңіз кім? ") # Жауапты айнымалыға жазады

# Жауапты экранға шығару
print("Танысқаныма қуаныштымын,", paydalanyshy_esimi)

# Екі санды қосу
san1 = 15
san2 = 25
natizhe = san1 + san2 # Математикалық амал

print("15 пен 25-тің қосындысы:", natizhe) # Жауабын шығару

# Қарапайым тексеру
jas = 12

if jas >= 10:
    print("Сен Python-ды үйренуге дайынсың!") # Егер шарт орындалса
else:
    print("Сәл өсе түсу керек, бірақ қазірден бастасаң да болады!") # Орындалмаса